#ifndef _YURIS_H_07ca1567_da0a_42e1_824d_5b8449ba05e4
#define _YURIS_H_07ca1567_da0a_42e1_824d_5b8449ba05e4

#include "pragma_once.h"

#include <Windows.h>
#include "my_headers.h"
#include "gal_common.h"

Void Init();
/*
static WChar f[] =
{
    '°°', 'Å@', '£°', 'ÅI', '°±', 'Åh', '££', 'Åî', '°Á', 'Åê',
    '£•', 'Åì', '£¶', 'Åï', '°Ø', 'Åf', '£®', 'Åi', '£©', 'Åj',
    '£™', 'Åñ', '£´', 'Å{', '£¨', 'ÅC', '£≠', 'Å|', '£Æ', 'ÅD',
    '£Ø', 'Å^', '£∞', 'ÇO', '£±', 'ÇP', '£≤', 'ÇQ', '£≥', 'ÇR',
    '£¥', 'ÇS', '£µ', 'ÇT', '£∂', 'ÇU', '£∑', 'ÇV', '£∏', 'ÇW',
    '£π', 'ÇX', '£∫', 'ÅF', '£ª', 'ÅG', '£º', 'ÅÉ', '£Ω', 'ÅÅ',
    '£æ', 'ÅÑ', '£ø', 'ÅH', '£¿', 'Åó', '£¡', 'Ç`', '£¬', 'Ça',
    '£√', 'Çb', '£ƒ', 'Çc', '£≈', 'Çd', '£∆', 'Çe', '£«', 'Çf',
    '£»', 'Çg', '£…', 'Çh', '£ ', 'Çi', '£À', 'Çj', '£Ã', 'Çk',
    '£Õ', 'Çl', '£Œ', 'Çm', '£œ', 'Çn', '£–', 'Ço', '£—', 'Çp',
    '£“', 'Çq', '£”', 'Çr', '£‘', 'Çs', '£’', 'Çt', '£÷', 'Çu',
    '£◊', 'Çv', '£ÿ', 'Çw', '£Ÿ', 'Çx', '£⁄', 'Çy', '£€', 'Åm',
    '£§', 'Åè', '£›', 'Ån', '£ﬁ', 'ÅO', '£ﬂ', 'ÅQ', '°Æ', 'Åe',
    '£·', 'ÇÅ', '£‚', 'ÇÇ', '£„', 'ÇÉ', '£‰', 'ÇÑ', '£Â', 'ÇÖ',
    '£Ê', 'ÇÜ', '£Á', 'Çá', '£Ë', 'Çà', '£È', 'Çâ', '£Í', 'Çä',
    '£Î', 'Çã', '£Ï', 'Çå', '£Ì', 'Çç', '£Ó', 'Çé', '£Ô', 'Çè',
    '£', 'Çê', '£Ò', 'Çë', '£Ú', 'Çí', '£Û', 'Çì', '£Ù', 'Çî',
    '£ı', 'Çï', '£ˆ', 'Çñ', '£˜', 'Çó', '£¯', 'Çò', '£˘', 'Çô',
    '£˙', 'Çö', '£˚', 'Åo', '£¸', 'Åb', '£˝', 'Åp', '£˛', 'ÅP',
};
*/

#endif // _YURIS_H_07ca1567_da0a_42e1_824d_5b8449ba05e4
